---
kind: other
id: Properties.T:Autodesk.Revit.DB.DirectShapeOptions
source: html/6990f444-d5cd-ad76-cdf8-8e21d023be74.htm
---
# DirectShapeOptions Properties

Specifies whether the .NET object represents a valid Revit entity.